{"pageProps":{"title":"Lord Gladden retires from inter-micronational community, King Jayden I named Gladden's successor if Lord Gladden abdicates from Oskonian throne","date":"2021-08-29T03:24:00.000Z","description":"During the Atieran-Galtean-Oskonian political crisis that shook all nations involved in it to the core, a complaint filed by Liam Alexander to the Superior Court of the Cupertino Alliance resulted in Lord Gladden...","content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, {})\n  })) : _createMdxContent();\n  function _createMdxContent() {\n    const _components = Object.assign({\n      p: \"p\"\n    }, _provideComponents(), props.components);\n    return _jsxs(_Fragment, {\n      children: [_jsx(_components.p, {\n        children: \"During the Atieran-Galtean-Oskonian political crisis that shook all nations involved in it to the core, a complaint filed by Liam Alexander to the Superior Court of the Cupertino Alliance resulted in Lord Gladden being found as below 13 years of age, which resulted in suspension from the CA. Subsequently, he released a statement to the public apologizing for what he did and in doing so, resigned from all micronational offices, including that of Lord-President of the Privy Council, a position created specifically for Lord Gladden by King Jayden I. Lord Gladden was then succeeded by His Grace Lord Paolo Evangelista, the Duke of Christophus. The King is expected, however, to mandate Lord Evangelista's resignation by 5 December, which is when Lord Gladden reaches the age of 13, and is when he is expected to return to the inter-micronational community.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Momentarily, after his suspension from the Cupertino Alliance, Liam Alexander reported Lord Gladden's account to Discord admins, which resulted in the subsequent disabling of Lord Gladden's account. He (referring to Lord Gladden) then released another statement, announcing his retirement from the inter-micronational community, naming the King (referring to Jayden I), currently Prime Minister in Oskonia, as his successor if he abdicates the throne of Oskonia, which we can say is still in the air, considering that Alexander basically ruined Gladden's micronational career. Lord Gladden has created a new account, but only few people have talked to Gladden via the said account.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"It is still possible to see Lord Gladden never returning to micronationalism after what Alexander did to him, and with that, a personal union between Oskonia and Novus Hierosolymis.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"UPDATE: We spoke to Lord Gladden and he clarified the possibility of his abdication.\"\n      })]\n    });\n  }\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"slug":"2021-08-lord-gladden-retires-from-inter"},"__N_SSG":true}