{"pageProps":{"title":"ANALYSIS: Who are the candidates running for President of the Micronational Community of Australia","date":"2022-03-30T16:42:34.756Z","description":"The campaign for President of the Micronational Community of Australia (MCA) has begun, with 3 candidates running to become the successor of Zechariah O'Hair, one of the founders of...","content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, {})\n  })) : _createMdxContent();\n  function _createMdxContent() {\n    const _components = Object.assign({\n      p: \"p\",\n      em: \"em\",\n      h2: \"h2\"\n    }, _provideComponents(), props.components);\n    return _jsxs(_Fragment, {\n      children: [_jsx(_components.p, {\n        children: _jsx(_components.em, {\n          children: \"Note: We are running this article as it concerns an ally of Novus Hierosolymis, the Empire of Lurdentania. This article isn't partial in any way, shape or form.\"\n        })\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The campaign for President of the Micronational Community of Australia (MCA) has begun, with 3 candidates running to become the successor of Zechariah O'Hair, one of the founders of the organization. Who are they, what are their platforms, and what should we take note of? We give you our impartial analysis on the candidates and what they are running on.\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"David Brooke\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"David Brooke focuses on a community-driven approach to running the MCA: he wants an “equal” community wherein power is shared, not delegated. Main points of his campaign include committees for membership and safety enforcement, monthly changes in the cabinet, and reaching out via Australian regions, among many others. A point of concern is the candidate riding on a community-driven campaign when he himself left the MCA in December of 2021 due to many controversies that surrounded him.\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"Rory McPhail\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Rory McPhail presents himself with his wealth of experience. He is focusing on stringent reforms to the Cabinet and services, increasing member participation within the community through cleanups and community nights, increasing membership via territorial membership and a foray into social media such as Twitter and Instagram, and reviving projects such as the monthly newsletter. McPhail served in many positions in the MCA, most notably as Minister of General Affairs and Membership.\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"Kevin Doan\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Kevin Doan presents himself as a choice against the old rhetoric allegedly shown by Brooke and McPhail: he is focusing on transparent leadership in his run for President by making actions open to the public. At this time Doan has not presented any other public platforms.\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"Overall analysis\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The elections for President of the MCA may prove to be one of the most contentious yet. It is a do-or-die election for them: will they be able to elect a leader who will continue the good work the organization has done for the Australian micronational community? Or will they elect a leader who will drag it down? We have yet to find that out.\"\n      })]\n    });\n  }\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"slug":"2022-03-analysis-who-are-candidates-running"},"__N_SSG":true}