{"pageProps":{"title":"Sophia Albina disgraced from the MicroWiki for Justice movement after scathing accusations","date":"2022-02-22T03:16:00.000Z","description":"Sophia Albina, Premier of Nordale and a leader of the MicroWiki for Justice movement was disgraced after strong and scathing accusations were released by former close associate...","content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, {})\n  })) : _createMdxContent();\n  function _createMdxContent() {\n    const _components = Object.assign({\n      p: \"p\",\n      em: \"em\"\n    }, _provideComponents(), props.components);\n    return _jsxs(_Fragment, {\n      children: [_jsx(_components.p, {\n        children: _jsx(_components.em, {\n          children: \"We remind readers that Jayden I, author of this article, is part of the MicroWiki for Justice movement, and was vocally against Sophia Albina after the release of the accusations. In addition, some parts may have been edited at the request of those involved, however those are limited to corrections.\"\n        })\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Sophia Albina, Premier of Nordale and a leader of the MicroWiki for Justice movement was disgraced after strong and scathing accusations were released by former close associate and friend Brooklyn Kennedy, Prime Minister of the New Richmond Republic.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"In her scathing remarks posted both in the Grand Unified Micronational and the MicroWiki for Justice server, Kennedy stated that Albina tried to frame her as a creator of a \\\"wildly inappropriate, foul photoshop of a family member of an extremely prominent veteran community member\\\" to the MicroWiki administration, and when she confronted Albina about this, she went on a very incomprehensible rant accusing Kennedy of being a pawn for the MicroWiki administration and implied that she was a pedophile. Albina later admitted to fabricating the falsehood due to a resent of the perceived \\\"special treatment\\\" that Kennedy received from the MicroWiki administration, even though she knew that Kennedy herself was banned from the wiki due to a certain distasteful incident, and acted like it was not there to suit her narrative. Kennedy then affirmed her commitment to the cause of the MicroWiki for Justice movement, but said that she \\\"washes off\\\" Albina and wishes to not be associated with her any longer.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"In the MicroWiki for Justice server, Albina accused Kennedy of being a liar and manipulator, and hurled many transphobic and fatphobic slurs while Kennedy restated her position numerous times. After some time, Albina was removed from her position as an administrator of the MicroWiki for Justice server by Leon Montan, and he apologized for the events, adding Hunt Powell and Logan Ross to the administration team.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"As we have said before, CNC News will continue giving updates on the MicroWiki safeguarding controversy as soon as we have them.\"\n      })]\n    });\n  }\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"slug":"2022-02-sophia-albina-disgraced-from-microwiki"},"__N_SSG":true}