{"pageProps":{"title":"MicroWiki users rise to condemn unbanning of a certain controversial individual","date":"2022-02-21T16:52:00.000Z","description":"Over the past few days the MicroWiki sector has been rocked by controversy over the unbanning of disgraced micronationalist Zarel \"Zed\" Smith, former Prince of New Eiffel. On 29 January 2022, Andrew Creed, head administrator...","content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, {})\n  })) : _createMdxContent();\n  function _createMdxContent() {\n    const _components = Object.assign({\n      p: \"p\",\n      em: \"em\",\n      blockquote: \"blockquote\"\n    }, _provideComponents(), props.components);\n    return _jsxs(_Fragment, {\n      children: [_jsx(_components.p, {\n        children: _jsx(_components.em, {\n          children: \"Note: Jayden I is involved in the condemnation: he is a signatory of the joint statement and is a member of the \\\"MicroWiki for Justice\\\" movement.\"\n        })\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Over the past few days the MicroWiki sector has been rocked by controversy over the unbanning of disgraced micronationalist Zarel \\\"Zed\\\" Smith, former Prince of New Eiffel. On 29 January 2022, Andrew Creed, head administrator of the MicroWiki website, announced the unbanning with this statement:\"\n      }), \"\\n\", _jsxs(_components.blockquote, {\n        children: [\"\\n\", _jsx(_components.p, {\n          children: \"User has served his time. Absolutely do not harass this user upon their return to the wiki. Doing so will lead to an immediate ban on the wiki and Discord server.\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"MicroWiki users were outraged at this decision from the administration, and wrote a joint memorandum condemning this action. As of writing it has amassed over 95 signatures.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The administration has continually tried to silence members who shared their dismay at the action, with Creed repeatedly ordering MicroWiki@Discord members to cease their discussion on this certain action, and even banning individuals who kept expressing their disgust. Due to these actions, the de facto leaders of the MicroWiki for Justice movement, namely Leon Montan (President of Ponderosa Hills), Sophia Albina (Premier of Nordale), Elizabeth Lewis (Leader of Shoreline), and Cameron Koehler (King of Ikonia and member of the Novohierosolymian Constitutional Committee) created their own Discord server to increase signatories and to make it the replacement for MicroWiki@Discord.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Koehler then proceeded to use backdoors left open via a bot he created when he was a server administrator to ban all persons he could, with 1,996 users removed from the server and leaving only around 40 or so people with Discord roles that were too high to ban. This caused his indefinite ban from MicroWiki and members of the Grand Unified Micronational losing confidence in him as their Supreme Justice.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The controversy has also spilled into famed statistics company Statistic-Dime founded by the same Zarel Smith, where Creed and Christina Nowell resigned from their posts as members of the Board of Directors, with Liam Alexander, CEO of Statistic-Dime having both \\\"great shame to see these two tender their resignations\\\" and satisfaction \\\"in a sense they will not be here to disturb the peace anymore\\\". This resulted in the addition of Jayden I as Director.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"As of writing, we at the CNC do not know when this controversy will die down, but we know that this is an unprecedented moment in the history of the MicroWiki sector and is a consequential event. We will continue giving readers of CNC News updates as soon as we have them.\"\n      })]\n    });\n  }\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}}},"__N_SSG":true}