{"pageProps":{"title":"Snyder-Murray wins CA election in a landslide: Valentinus loses for a second time","date":"2022-01-25T07:44:00.000Z","description":"CNC News projects that Carson Snyder and James Murray will be the next Chair and Lieutenant Chair of the Cupertino Alliance, after the 1:30AM EST update from the Cupertino Electoral Supervisory Commission...","socialImage":"/images/ca-election-jan-2022.png","content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, {})\n  })) : _createMdxContent();\n  function _createMdxContent() {\n    const _components = Object.assign({\n      em: \"em\",\n      p: \"p\"\n    }, _provideComponents(), props.components);\n    return _jsxs(_Fragment, {\n      children: [_jsxs(\"div\", {\n        class: \"text-center\",\n        children: [_jsx(\"div\", {\n          children: _jsx(\"img\", {\n            class: \"mx-auto\",\n            src: \"/images/ca-election-jan-2022.png\"\n          })\n        }), _jsx(\"p\", {\n          children: _jsx(_components.em, {\n            children: \"The two candidates for Chair: Snyder and Valentinus.\"\n          })\n        })]\n      }), \"\\n\", _jsx(_components.p, {\n        children: _jsx(_components.em, {\n          children: \"Jayden I is involved in this election: he is part of the Snyder-Murray campaign team.\"\n        })\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"UPDATE: Final data from CESE awards 19 votes for Snyder-Murray and 7 votes for Valentinus-Neal.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"CNC News projects that Carson Snyder and James Murray will be the next Chair and Lieutenant Chair of the Cupertino Alliance, after the 1:30AM EST update from the Cupertino Electoral Supervisory Commission or CESE gave 17 votes to Snyder-Murray and a mere 6 votes for Valentinus-Neal.\\nThis comes after a very quiet campaign season, which is mostly due to the last 2 campaign seasons, which were smeared by constant uncivil discussions among members of the Alliance.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"This is also the first election under the 2021 Charter, which was passed in December.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Snyder ran on a platform focusing on development: some promises their campaign made include an emphasis on development, adoptable and adaptable legislation, and expanding outreach.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Valentinus ran on an \\\"open and accessible\\\" platform: flipping the status quo on its head and moving back to the 2020 era-Alliance with a plan of reviving the long-dead Windhoek program, as well as focusing on essential services rather than non-sensical and unneeded ones, such as the Statistics Ministry.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"A pre-election poll from Statistic-Dime showed that 70% were in support of Snyder, while a measly 30% supported Valentinus.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Snyder and Murray will take office at the end of this month, the final day of Tyler Mullins and Larry Martin's term.\"\n      })]\n    });\n  }\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"slug":"2022-01-snyder-murray-wins-ca-election-in"},"__N_SSG":true}